content.org
#+TITLE: CS 421 Web Content
#+HUGO_BASE_DIR: .
#+HUGO_SECTION: lectures

** Grading Details
:PROPERTIES:
:EXPORT_FILE_NAME: grading-faq
:ID:       6f2ced9d-b009-43e6-93e2-63bc29d1c708
:END:

*** Learning Modules and Outcomes

- There are 20 learning modules in the course, each themed around a specific course topic.
- Each learning module has 10 points that we distribute among one or more /outcomes/.
- Each outcome has one or more assessments that will "fulfill" it if completed.
- To fulfill a learning module you must complete enough outcomes to have 10 points in the learning module.
  - Most learning modules will have exactly 10 points, but it is possible for there to be more than 10.
    In those cases, you still only need to get 10 points.
- You cannot partially complete a learning module.

*** Assessments

There are four kinds of assessments you will see.

- Machine problems (MPs) :: These are long programming assignments.  The threshold for passing them is 95%.
  - Before the MP is due you can get full credit on it.
  - There is a one-week extension period in which you can only get 95%. Thus, you must fully complete the MP for it to
    count.
- Exam Questions :: Most exam questions involve coding or some kind of mathematical manipulation (like lambda calculus reductions).
  - The threshold for passing an exam question is 100%, except for proof trees.  These are passing at 95%.
  - If you don't get an exam question right, you will have another attempt on the following midterm (if there is one).
  - You will also get an attempt on the final exam.
  - An exam question usually will affect only a single outcome.  If you miss an exam question you only need to focus on the outcomes
    you missed, not the whole learning module.
- Activity Questions ::
  - Activities are primarily designed for you to practice the assessments you will see on an exam.
  - An activity /may/ contribute to some of the outcomes of a learning module, but not always.
  - We use the score for the whole activity, not the individual questions within it.
- In-Class POGIL Activities ::
  - These are graded based on participation. Signing into a POGIL group on PrairieLearn during the class period (for
    live section) or during the next five days (for asynchronous students) will be called "attendance".
  - In order to get an A in the class, you must attend (or be excused from) 80% of the group activities.

